saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Nuvoton</vendor>
  <url>http://www.nuvoton.com/hq/enu/Documents/KEILSoftwarePack</url>
  <name>NuMicro_DFP</name>
  <description>Nuvoton ARM Cortex-M NuMicro Family Device Support</description>

  <releases>
    <release version="1.3.2" date="2018-09-10">
	  Add system and startup files
	</release>
    <release version="1.3.1" date="2018-09-06">
	  1. Add M480 series part no.
	  2. Remove device driver file
	  3. Remove ISD and NuVoice Family
	</release>
    <release version="1.3.0" date="2018-08-20">
	  1. Add M23 and M4 family
	  2. Add M031, NUC029DE/EE/GE, NUC1261, M4521, NM1230, NDA102, M251/M252 series device
	</release>
    <release version="1.2.2" date="2018-06-05">
	  M2351 secure and non-secure region defalt value
	</release>
    <release version="1.2.1" date="2018-04-13">
	  Improved PDSC file, adding include paths for device peripherals and new date feature and update svd file
	</release>
    <release version="1.2.0">
	  Add M2351 and NUC2201 series device and svd file and update NUC100, NUC200, M480, NUC505 series example code
	</release>
    <release version="1.1.0">
	  Add M0564, NUC121, NUC125, NUC126, Mini57 and M480 series example code
	</release>
    <release version="1.0.9">
	  Rename Generic series
	</release>
    <release version="1.0.8">
      Add Nano103, NM1120, NM1330, NM1820 series svd file and update M051, M058S, Mini51, Nano100bn, Nano103, NUC123, NUC200, NUC505 series example code
	</release>
    <release version="1.0.7">
      Add NM1200 series example code and update svd file
	</release>
    <release version="1.0.6">
      Add Nano103, NM1120, NM1320, NM1330, NM1820 chip, update M0519, NUC230_240, NUC472, M451 series example code
	</release>
    <release version="1.0.5">
      Add Mini55 chip, update Mini58, NUC100, NUC122, NUC123, Nano100AN, Nano112, NUC200, NUC230_240 series example code
    </release>
    <release version="1.0.4">
      Add NUC122, M058S, Mini58, M0519 series example code
    </release>
    <release version="1.0.3">
      Add M451, NUC100, NUC200, NUC123, NUC029, M0518, NUC131, NANO100BN, NUC505 series example code
    </release>
    <release version="1.0.2">
      Add ISD9100, ISD9300, N571, N572 svd file and M4LED chip series
    </release>
    <release version="1.0.1">
      Add (M051, Mini51, Nano112, NUC240, NUC472) example code and new chip series
    </release>
    <release version="1.0.0">
      First Release version of NuMicro Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Nuvoton</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Nuvoton</keyword>
    <keyword>NuMicro</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->
    <family Dfamily="NuMicro M0 Family" Dvendor="Nuvoton:18">
      <!-- *************************  Subfamily 'Generic'  ***************************** -->
      <subFamily DsubFamily="Generic">
        <description>The NuMicro Generic Series 32-bit microcontroller</description>
        <!-- *************************  Device 'Generic M051'  ***************************** -->
        <device Dname="Generic_M051_Series">
          <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
          <compile    header="Device/M051/Include/M051Series.h"/>
          <debug      svd   ="SVD/Nuvoton/M051AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M0516_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>
		
        <!-- *************************  Device 'Generic Mini51'  ***************************** -->
          <device Dname="Generic_Mini51_Series">
          <processor  Dcore="Cortex-M0"  Dclock="24000000"/>
          <compile    header="Device/Mini51/Include/Mini51Series.h"/>
          <debug      svd   ="SVD/Nuvoton/MINI51AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="30"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'Generic NANO100'  ***************************** -->
        <device Dname="Generic_Nano100_Series">		
          <processor  Dcore="Cortex-M0"  Dclock="32000000"/>
          <compile    header="Device/NANO100AN/Include/Nano100Series.h"/>
          <debug      svd   ="SVD/Nuvoton/NANO100AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_123.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="86"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>
		
        <!-- *************************  Device 'Generic NUC100'  ***************************** -->		
        <device Dname="Generic_NUC100_Series">
          <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
          <compile    header="Device/NUC100/Include/NUC100Series.h"/>
          <debug      svd   ="SVD/Nuvoton/NUC100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="84"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'Generic NUC200'  ***************************** -->
        <device Dname="Generic_NUC200_Series">
          <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
          <compile    header="Device/NUC200/Include/NUC200Series.h"/>
          <debug      svd   ="SVD/Nuvoton/NUC200AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="76"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'M031'  ***************************** -->
      <subFamily DsubFamily="M031">
        <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
        <compile    header="Device/M031/Include/M031Series.h"/>
        <description>The Nuvoton Cortex-M0 based NuMicro M031/M032 series MCU features 1.8 ~ 3.6V operating voltage, running up to 48 MHz,
 and provides a good solution for the applications that need low-voltage interface connection operation. This product can be applied to mobile devices, 
 application processor connected peripheral controllers, IoT sensor devices, motor control, industrial control, and consumer devices.</description>
        <!-- *************************  Device 'M031FB0AE'  ***************************** -->
        <device Dname="M031FB0AE">
          <debug      svd   ="SVD/Nuvoton/M031AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M031_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/M031_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="15"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
        </device>

        <!-- *************************  Device 'M031EB0AE'  ***************************** -->
        <device Dname="M031EB0AE">
          <debug      svd   ="SVD/Nuvoton/M031AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M031_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/M031_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="23"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
        </device>

