saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'M0516LDE'  ***************************** -->
        <device Dname="M0516LDE">
          <debug      svd   ="SVD/Nuvoton/M051DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M0516_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M0516ZDE'  ***************************** -->
        <device Dname="M0516ZDE">
          <debug      svd   ="SVD/Nuvoton/M051DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M0516_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="24"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="5"	m="16"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'M058S'  ***************************** -->
      <subFamily DsubFamily="M058S">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/M058S/Include/M058S.h"/>
        <description>The NuMicro M058S is a 32-bit microcontroller with embedded ARM Cortex-M0 core for industrial control and applications which need rich communication interfaces. 
The Cortex-M0 is ARM embedded processor with 32-bit performance and cost-effective microcontroller. </description>
        <!-- *************************  Device 'M058SFAN'  ***************************** -->
        <device Dname="M058SFAN">
          <debug      svd   ="SVD/Nuvoton/M058SAN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M058_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="14"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="PWM"  		n="1"	m="16"/>
          <feature type="ADC"  		n="2"	m="12"/>
        </device>

        <!-- *************************  Device 'M058SZAN'  ***************************** -->
        <device Dname="M058SZAN">
          <debug      svd   ="SVD/Nuvoton/M058SAN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M058_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="26"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="PWM"  		n="2"	m="16"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'M058SLAN'  ***************************** -->
        <device Dname="M058SLAN">
          <debug      svd   ="SVD/Nuvoton/M058SAN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M058_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="42"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M058SSAN'  ***************************** -->
        <device Dname="M058SSAN">
          <debug      svd   ="SVD/Nuvoton/M058SAN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M051_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M051_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M058_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="55"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'Mini51'  ***************************** -->
      <subFamily DsubFamily="Mini51">
        <processor  Dcore="Cortex-M0"  Dclock="24000000"/>
        <compile    header="Device/Mini51/Include/Mini51Series.h"/>
        <description>The NuMicro Mini51 series 32-bit microcontroller is embedded with ARM Cortex-M0 core for industrial control and applications 
which require high performance, high integration, and low cost. The Cortex-M0 is the newest ARM embedded processor with 32-bit performance 
at a cost equivalent to the traditional 8-bit microcontroller.</description>
        <!-- *************************  Device 'Mini51LAN'  ***************************** -->
        <device Dname="Mini51LAN">
          <debug      svd   ="SVD/Nuvoton/MINI51AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x1000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_4.FLM"        start="0x00000000"  size="0x1000"                   default="1"/>
          <feature type="IOs"  		n="30"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'Mini51ZAN'  ***************************** -->
        <device Dname="Mini51ZAN">
          <debug      svd   ="SVD/Nuvoton/MINI51AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x1000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_4.FLM"        start="0x00000000"  size="0x1000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini51TAN'  ***************************** -->
        <device Dname="Mini51TAN">
          <debug      svd   ="SVD/Nuvoton/MINI51AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x1000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_4.FLM"        start="0x00000000"  size="0x1000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

