saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'Mini57EDE'  ***************************** -->
        <device Dname="Mini57EDE">
          <debug      svd   ="SVD/Nuvoton/MINI57DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini57_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini57_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini57_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
        </device>

        <!-- *************************  Device 'Mini57XDE'  ***************************** -->
        <device Dname="Mini57XDE">
          <debug      svd   ="SVD/Nuvoton/MINI57DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini57_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini57_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini57_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="20"/>
        </device>

        <!-- *************************  Device 'Mini57TDE'  ***************************** -->
        <device Dname="Mini57TDE">
          <debug      svd   ="SVD/Nuvoton/MINI57DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini57_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini57_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini57_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'Mini58'  ***************************** -->
      <subFamily DsubFamily="Mini58">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/Mini58/Include/Mini58Series.h"/>
        <description>The NuMicro Mini58 series 32-bit microcontroller is embedded with ARMR Cortex-M0 core for industrial control and applications which
require high performance, high integration, and low cost. The Cortex-M0 is the newest ARMR embedded processor with 32-bit performance at a cost equivalent
to the traditional 8-bit microcontroller</description>
        <!-- *************************  Device 'Mini58LDE'  ***************************** -->
        <device Dname="Mini58LDE">
          <debug      svd   ="SVD/Nuvoton/MINI58DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2_5.FLM"        start="0x00100000"  size="0xa00"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="30"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'Mini58ZDE'  ***************************** -->
        <device Dname="Mini58ZDE">
          <debug      svd   ="SVD/Nuvoton/MINI58DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2_5.FLM"        start="0x00100000"  size="0xa00"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini58TDE'  ***************************** -->
        <device Dname="Mini58TDE">
          <debug      svd   ="SVD/Nuvoton/MINI58DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2_5.FLM"        start="0x00100000"  size="0xa00"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini58FDE'  ***************************** -->
        <device Dname="Mini58FDE">
          <debug      svd   ="SVD/Nuvoton/MINI58DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2_5.FLM"        start="0x00100000"  size="0xa00"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="4"	m="10"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'Mini55'  ***************************** -->
      <subFamily DsubFamily="Mini55">
        <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
        <compile    header="Device/Mini55/Include/Mini55Series.h"/>
        <description>The NuMicro Mini55 series 32-bit microcontroller is embedded with Cortex-M0 core for industrial control and applications which require high performance, high integration, and low cost.</description>
        <!-- *************************  Device 'Mini51XLAE'  ***************************** -->
        <device Dname="Mini51XLAE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x1000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_4.FLM"        start="0x00000000"  size="0x1000"                   default="1"/>
          <feature type="IOs"  		n="33"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'Mini51XZAE'  ***************************** -->
        <device Dname="Mini51XZAE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x1000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_4.FLM"        start="0x00000000"  size="0x1000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini52XLAE'  ***************************** -->
        <device Dname="Mini52XLAE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_8.FLM"        start="0x00000000"  size="0x2000"                   default="1"/>
          <feature type="IOs"  		n="33"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

