saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'Mini52XZAE'  ***************************** -->
        <device Dname="Mini52XZAE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_8.FLM"        start="0x00000000"  size="0x2000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini54XLAE'  ***************************** -->
        <device Dname="Mini54XLAE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="33"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'Mini54XZAE'  ***************************** -->
        <device Dname="Mini54XZAE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini54XFHC'  ***************************** -->
        <device Dname="Mini54XFHC">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
        </device>

        <!-- *************************  Device 'Mini55LDE'  ***************************** -->
        <device Dname="Mini55LDE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="30"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'Mini55ZDE'  ***************************** -->
        <device Dname="Mini55ZDE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'Mini55TDE'  ***************************** -->
        <device Dname="Mini55TDE">
          <debug      svd   ="SVD/Nuvoton/MINI51XAE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Mini51_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/Mini51_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NDA102'  ***************************** -->
      <subFamily DsubFamily="NDA102">
        <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
        <compile    header="Device/NDA102/Include/NDA102Series.h"/>
        <description>The NuMicro NDA102 series 32-bit microcontrollers are embedded with Cortex-M0 core for industrial applications which need high performance, high integration, and low cost.</description>
        <!-- *************************  Device 'NDA102EC1'  ***************************** -->
        <device Dname="NDA102EC1">
          <debug      svd   ="SVD/Nuvoton/NDA102_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NDA102_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NDA102_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
        </device>

        <!-- *************************  Device 'NDA102FC1'  ***************************** -->
        <device Dname="NDA102FC1">
          <debug      svd   ="SVD/Nuvoton/NDA102_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NDA102_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NDA102_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC029AN'  ***************************** -->
      <subFamily DsubFamily="NUC029AN">
        <description>The NuMicro NUC029 series is a 32-bit microcontroller with embedded ARM Cortex-M0 core with 32-bit performance.</description>
        <!-- *************************  Device 'NUC029LAN'  ***************************** -->
        <device Dname="NUC029LAN">
          <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
          <compile    header="Device/NUC029AN/Include/NUC029xAN.h"/>
          <debug      svd   ="SVD/Nuvoton/NUC029AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC029TAN'  ***************************** -->
        <device Dname="NUC029TAN">
          <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
          <compile    header="Device/NUC029AN/Include/NUC029xAN.h"/>
          <debug      svd   ="SVD/Nuvoton/NUC029AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="24"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="5"	m="16"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC029AE'  ***************************** -->
      <subFamily DsubFamily="NUC029AE">
        <description>The NuMicro NUC029 series is a 32-bit microcontroller with embedded ARM Cortex-M0 core with 32-bit performance.</description>
        <!-- *************************  Device 'NUC029FAE'  ***************************** -->
        <device Dname="NUC029FAE">
          <processor  Dcore="Cortex-M0"  Dclock="24000000"/>
          <compile    header="Device/NUC029AE/Include/NUC029FAE.h"/>
          <debug      svd   ="SVD/Nuvoton/NUC029AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="PWM"  		n="3"	m="16"/>
          <feature type="ADC"  		n="4"	m="10"/>
        </device>
      </subFamily>

