saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
      <!-- *************************  Subfamily 'NUC029DE'  ***************************** -->
      <subFamily DsubFamily="NUC029DE">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/NUC029DE/Include/NUC029xDE.h"/>
        <description>The NuMicro NUC029 series is a 32-bit microcontroller with embedded ARM Cortex-M0 core with 32-bit performance.</description>
        <!-- *************************  Device 'NUC029LDE'  ***************************** -->
        <device Dname="NUC029LDE">
          <debug      svd   ="SVD/Nuvoton/NUC029DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x11000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_68.FLM"        start="0x00000000"  size="0x11000"                   default="1"/>
          <feature type="IOs"  		n="42"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC029SDE'  ***************************** -->
        <device Dname="NUC029SDE">
          <debug      svd   ="SVD/Nuvoton/NUC029DE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x11000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_68.FLM"        start="0x00000000"  size="0x11000"                   default="1"/>
          <feature type="IOs"  		n="56"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC029EE'  ***************************** -->
      <subFamily DsubFamily="NUC029EE">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/NUC029EE/Include/NUC029xEE.h"/>
        <description>The NuMicro NUC029 series is a 32-bit microcontroller with embedded ARM Cortex-M0 core with 32-bit performance.</description>
        <!-- *************************  Device 'NUC029LEE'  ***************************** -->
        <device Dname="NUC029LEE">
          <debug      svd   ="SVD/Nuvoton/NUC029EE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="31"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC029SEE'  ***************************** -->
        <device Dname="NUC029SEE">
          <debug      svd   ="SVD/Nuvoton/NUC029EE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="45"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC029GE'  ***************************** -->
      <subFamily DsubFamily="NUC029GE">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/NUC029GE/Include/NUC029xGE.h"/>
        <description>The NuMicro NUC029 series is a 32-bit microcontroller with embedded ARM Cortex-M0 core with 32-bit performance.</description>
        <!-- *************************  Device 'NUC029LGE'  ***************************** -->
        <device Dname="NUC029LGE">
<!--          <debug      svd   ="SVD/Nuvoton/NUC029GE_v1.svd"/>	-->
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029GE_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029GE_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC029SGE'  ***************************** -->
        <device Dname="NUC029SGE">
<!--          <debug      svd   ="SVD/Nuvoton/NUC029GE_v1.svd"/>	-->
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC029GE_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC029GE_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="49"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="15"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC100'  ***************************** -->
      <subFamily DsubFamily="NUC100">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/NUC100/Include/NUC100Series.h"/>
        <description>The NuMicro NUC100 Series 32-bit microcontroller is embedded with ARM Cortex-M0 core for industrial control and applications that 
need rich communication interfaces. The Cortex-M0 is the newest ARM embedded processor with 32-bit performance and at a cost equivalent to traditional 
8-bit microcontroller. The NuMicro NUC100 Series includes NUC100, NUC120, NUC130 and NUC140 product lines.</description>
        <!-- *************************  Device 'NUC100LC1BN'  ***************************** -->
        <device Dname="NUC100LC1BN">
          <debug      svd   ="SVD/Nuvoton/NUC100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC100LD1BN'  ***************************** -->
        <device Dname="NUC100LD1BN">
          <debug      svd   ="SVD/Nuvoton/NUC100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC100LD2BN'  ***************************** -->
        <device Dname="NUC100LD2BN">
          <debug      svd   ="SVD/Nuvoton/NUC100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

