saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC100RE3DN'  ***************************** -->
        <device Dname="NUC100RE3DN">
          <debug      svd   ="SVD/Nuvoton/NUC100DN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="51"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC100VD2DN'  ***************************** -->
        <device Dname="NUC100VD2DN">
          <debug      svd   ="SVD/Nuvoton/NUC100DN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="84"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC100VD3DN'  ***************************** -->
        <device Dname="NUC100VD3DN">
          <debug      svd   ="SVD/Nuvoton/NUC100DN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="84"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC100VE3DN'  ***************************** -->
        <device Dname="NUC100VE3DN">
          <debug      svd   ="SVD/Nuvoton/NUC100DN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="84"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC100VE3DE'  ***************************** -->
        <device Dname="NUC100VE3DE">
          <debug      svd   ="SVD/Nuvoton/NUC100DN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="84"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC120LC1BN'  ***************************** -->
        <device Dname="NUC120LC1BN">
          <debug      svd   ="SVD/Nuvoton/NUC100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="31"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

