saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC131SC2AE'  ***************************** -->
        <device Dname="NUC131SC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC131AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x9000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_36.FLM"        start="0x00000000"  size="0x9000"                   default="1"/>
          <feature type="IOs"  		n="56"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="CAN"  		n="1"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC131SD2AE'  ***************************** -->
        <device Dname="NUC131SD2AE">
          <debug      svd   ="SVD/Nuvoton/NUC131AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x11000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_68.FLM"        start="0x00000000"  size="0x11000"                   default="1"/>
          <feature type="IOs"  		n="56"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="CAN"  		n="1"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC122'  ***************************** -->
      <subFamily DsubFamily="NUC122">
        <processor  Dcore="Cortex-M0"  Dclock="60000000"/>
        <compile    header="Device/NUC122/Include/NUC122.h"/>
        <description>The NuMicro NUC122 series are 32-bit microcontrollers with Cortex-M0 core runs up to 60 MHz, up to 32K/64K-byte embedded flash, 
4K/8K-byte embedded SRAM, and 4K-byte loader ROM for the In System Program (ISP) function. It also integrates Timers, Watchdog Timer, RTC, UART, 
SPI, I2C, PWM Timer, GPIO, USB 2.0 Full Speed Device, Low Voltage Reset Controller and Brownout Detector.</description>
        <!-- *************************  Device 'NUC122ZC1AN'  ***************************** -->
        <device Dname="NUC122ZC1AN">
          <debug      svd   ="SVD/Nuvoton/NUC122_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NUC122ZD2AN'  ***************************** -->
        <device Dname="NUC122ZD2AN">
          <debug      svd   ="SVD/Nuvoton/NUC122_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NUC122LC1AN'  ***************************** -->
        <device Dname="NUC122LC1AN">
          <debug      svd   ="SVD/Nuvoton/NUC122_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="32"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC122LD2AN'  ***************************** -->
        <device Dname="NUC122LD2AN">
          <debug      svd   ="SVD/Nuvoton/NUC122_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="32"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC122SC1AN'  ***************************** -->
        <device Dname="NUC122SC1AN">
          <debug      svd   ="SVD/Nuvoton/NUC122_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="43"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC122SD2AN'  ***************************** -->
        <device Dname="NUC122SD2AN">
          <debug      svd   ="SVD/Nuvoton/NUC122_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="43"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC123'  ***************************** -->
      <subFamily DsubFamily="NUC123">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/NUC123/Include/NUC123.h"/>
        <description>The NuMicro NUC123 series 32-bit microcontrollers are embedded with Cortex-M0 core running up to 72 MHz, up to 36K/68K-byte embedded flash, 
12K/20K-byte embedded SRAM, and 4K-byte loader ROM for the ISP. It also integrates Timers, Watchdog Timer, Windowed Watchdog Timer, PDMA with CRC calculation unit, 
UART, SPI/MICROWIRE, I2C, I2S, PWM Timer, GPIO, PS/2, USB 2.0 FS Device, 10-bit ADC, Low Voltage Reset Controller and Brown-out Detector.</description>
        <!-- *************************  Device 'NUC123ZC2AN1'  ***************************** -->
        <device Dname="NUC123ZC2AN1">
          <debug      svd   ="SVD/Nuvoton/NUC123AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x9000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_36.FLM"        start="0x00000000"  size="0x9000"                   default="1"/>
          <feature type="IOs"  		n="20"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="2"	m="16"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NUC123ZD4AN0'  ***************************** -->
        <device Dname="NUC123ZD4AN0">
          <debug      svd   ="SVD/Nuvoton/NUC123AN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x11000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_68.FLM"        start="0x00000000"  size="0x11000"                   default="1"/>
          <feature type="IOs"  		n="20"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="2"	m="16"/>
          <feature type="QFN"  		n="33"/>
        </device>

