saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC123SC2AE1'  ***************************** -->
        <device Dname="NUC123SC2AE1">
          <debug      svd   ="SVD/Nuvoton/NUC123AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x9000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_36.FLM"        start="0x00000000"  size="0x9000"                   default="1"/>
          <feature type="IOs"  		n="47"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC123SD4AE0'  ***************************** -->
        <device Dname="NUC123SD4AE0">
          <debug      svd   ="SVD/Nuvoton/NUC123AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x11000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC100_AP_68.FLM"        start="0x00000000"  size="0x11000"                   default="1"/>
          <feature type="IOs"  		n="47"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC121'  ***************************** -->
      <subFamily DsubFamily="NUC121">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/NUC121/Include/NUC121.h"/>
        <description>The NuMicro NUC121/125 series is a 32-bit Cortex-M0 microcontroller with USB 2.0 Full-speed device, a 12-bit ADC and 4 sets of 6-channel BPWM.
The NUC121/125 series provides the high 50 MHz operating speed, 8 Kbytes SRAM, 8 USB endpoints and 24 channels of BPWM, which make it powerful in USB communication and data processing.</description>
        <!-- *************************  Device 'NUC121ZC2AE'  ***************************** -->
        <device Dname="NUC121ZC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC121AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC121_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_LD_4_5.FLM"        start="0x00100000"  size="0x1200"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="17"	m="16"/>
          <feature type="ADC"  		n="4"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NUC121LC2AE'  ***************************** -->
        <device Dname="NUC121LC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC121AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC121_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_LD_4_5.FLM"        start="0x00100000"  size="0x1200"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="38"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFN"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC121SC2AE'  ***************************** -->
        <device Dname="NUC121SC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC121AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC121_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_LD_4_5.FLM"        start="0x00100000"  size="0x1200"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="52"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="QFN"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC125ZC2AE'  ***************************** -->
        <device Dname="NUC125ZC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC121AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC121_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_LD_4_5.FLM"        start="0x00100000"  size="0x1200"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="17"	m="16"/>
          <feature type="ADC"  		n="4"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

