saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC125LC2AE'  ***************************** -->
        <device Dname="NUC125LC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC121AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC121_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_LD_4_5.FLM"        start="0x00100000"  size="0x1200"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="37"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFN"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC125SC2AE'  ***************************** -->
        <device Dname="NUC125SC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC121AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC121_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_LD_4_5.FLM"        start="0x00100000"  size="0x1200"                   default="0"/>
          <algorithm  name  ="Flash/NUC121_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="51"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="QFN"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NUC126'  ***************************** -->
      <subFamily DsubFamily="NUC126">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/NUC126/Include/NUC126.h"/>
        <description>The NuMicro NUC126 series microcontroller based on the Cortex-M0 core operates at up to 72 MHz.
With its crystal-less USB 2.0 FS interface, it is able to generate precise frequency required by USB protocol without the need of external crystal.</description>
        <!-- *************************  Device 'NUC126LE4AE'  ***************************** -->
        <device Dname="NUC126LE4AE">
          <debug      svd   ="SVD/Nuvoton/NUC126AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC126_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="41"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC126LG4AE'  ***************************** -->
        <device Dname="NUC126LG4AE">
          <debug      svd   ="SVD/Nuvoton/NUC126AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC126_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="41"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC126RE4AE'  ***************************** -->
        <device Dname="NUC126RE4AE">
          <debug      svd   ="SVD/Nuvoton/NUC126AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC126_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="53"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="15"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC126RG4AE'  ***************************** -->
        <device Dname="NUC126RG4AE">
          <debug      svd   ="SVD/Nuvoton/NUC126AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC126_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NUC126_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="53"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="15"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

