saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
      <!-- *************************  Subfamily 'M0519'  ***************************** -->
      <subFamily DsubFamily="M0519">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/M0519/Include/M0519.h"/>
        <description>The NuMicro M0519 Series 32-bit microcontroller is embedded with the newest ARM Cortex-M0 core at a cost equivalent to traditional 
8-bit microcontroller for industrial control and applications which need high performance.</description>

        <!-- *************************  Device 'M0519VE3AE'  ***************************** -->
        <device Dname="M0519VE3AE">
          <debug      svd   ="SVD/Nuvoton/M0519AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0519_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0519_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/M0519_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="82"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="14"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'M0519SE3AE'  ***************************** -->
        <device Dname="M0519SE3AE">
          <debug      svd   ="SVD/Nuvoton/M0519AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0519_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0519_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/M0519_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="51"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M0519SD3AE'  ***************************** -->
        <device Dname="M0519SD3AE">
          <debug      svd   ="SVD/Nuvoton/M0519AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0519_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0519_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/M0519_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="51"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M0519LE3AE'  ***************************** -->
        <device Dname="M0519LE3AE">
          <debug      svd   ="SVD/Nuvoton/M0519AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0519_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0519_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/M0519_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="38"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M0519LD3AE'  ***************************** -->
        <device Dname="M0519LD3AE">
          <debug      svd   ="SVD/Nuvoton/M0519AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0519_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0519_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/M0519_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="38"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'M0564'  ***************************** -->
      <subFamily DsubFamily="M0564">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/M0564/Include/M0564.h"/>
        <description>The NuMicro M0564 series microcontroller based on the Cortex-M0 core operates at up to 72 MHz.
It features adjustable VDDIO pins for specific I/O pins with a wide range of voltage from 1.8V to 5.5V for various operating voltages of external components,
a unique high-speed PWM with clock frequency up to 144 MHz for precision control, and an integrated hardware divider to speed up the calculation for the control algorithms.</description>
        <!-- *************************  Device 'M0564LE4AE'  ***************************** -->
        <device Dname="M0564LE4AE">
          <debug      svd   ="SVD/Nuvoton/M0564AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0564_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0564_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M0564_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="41"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M0564LG4AE'  ***************************** -->
        <device Dname="M0564LG4AE">
          <debug      svd   ="SVD/Nuvoton/M0564AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0564_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0564_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M0564_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="41"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M0564RE4AE'  ***************************** -->
        <device Dname="M0564RE4AE">
          <debug      svd   ="SVD/Nuvoton/M0564AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M0564_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M0564_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M0564_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="53"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="15"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

