saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
      <!-- *************************  Subfamily 'NUC2201'  ***************************** -->
      <subFamily DsubFamily="NUC2201">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/NUC2201/Include/NUC2201.h"/>
        <description>The NuMicro NUC2201 series 32-bit microcontrollers are embedded with the ARM Cortex-M0 core with a cost equivalent to traditional 8-bit MCU for industrial control and applications requiring rich communication interfaces.</description>
        <!-- *************************  Device 'NUC2201LE3AE'  ***************************** -->
        <device Dname="NUC2201LE3AE">
          <debug      svd   ="SVD/Nuvoton/NUC2201AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="31"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC2201SE3AE'  ***************************** -->
        <device Dname="NUC2201SE3AE">
          <debug      svd   ="SVD/Nuvoton/NUC2201AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="45"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>
	  
      <!-- *************************  Subfamily 'NUC230_240'  ***************************** -->
      <subFamily DsubFamily="NUC230_240">
        <processor  Dcore="Cortex-M0"  Dclock="72000000"/>
        <compile    header="Device/NUC230_240/Include/NUC230_240.h"/>
        <description>The NuMicro NUC230_240 Series 32-bit microcontrollers is embedded with the newest ARM Cortex-M0 core with a cost equivalent to traditional 8-bit MCU 
for industrial control and applications requiring rich communication interfaces. The NuMicro NUC230_240 Series includes NUC230 and NUC240 product lines.</description>
        <!-- *************************  Device 'NUC230RC1AE'  ***************************** -->
        <device Dname="NUC230RC1AE">
          <debug      svd   ="SVD/Nuvoton/NUC200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="CAN"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC230LC2AE'  ***************************** -->
        <device Dname="NUC230LC2AE">
          <debug      svd   ="SVD/Nuvoton/NUC200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC230LD2AE'  ***************************** -->
        <device Dname="NUC230LD2AE">
          <debug      svd   ="SVD/Nuvoton/NUC200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC230LE3AE'  ***************************** -->
        <device Dname="NUC230LE3AE">
          <debug      svd   ="SVD/Nuvoton/NUC200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NUC200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

