saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NANO100LD2BN'  ***************************** -->
        <device Dname="NANO100LD2BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="38"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NANO100LD3BN'  ***************************** -->
        <device Dname="NANO100LD3BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="38"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NANO100LE3BN'  ***************************** -->
        <device Dname="NANO100LE3BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_123.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="38"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NANO100SC2BN'  ***************************** -->
        <device Dname="NANO100SC2BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="52"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NANO100SD2BN'  ***************************** -->
        <device Dname="NANO100SD2BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="52"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NANO100SD3BN'  ***************************** -->
        <device Dname="NANO100SD3BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="52"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NANO100SE3BN'  ***************************** -->
        <device Dname="NANO100SE3BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_123.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="52"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NANO100KC2BN'  ***************************** -->
        <device Dname="NANO100KC2BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="86"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'NANO100KC3BN'  ***************************** -->
        <device Dname="NANO100KC3BN">
          <debug      svd   ="SVD/Nuvoton/NANO100BN_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/Nano100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/Nano100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="86"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

