saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NM1120FC1AE'  ***************************** -->
        <device Dname="NM1120FC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
        </device>

        <!-- *************************  Device 'NM1120EC1AE'  ***************************** -->
        <device Dname="NM1120EC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
        </device>

        <!-- *************************  Device 'NM1120XC1AE'  ***************************** -->
        <device Dname="NM1120XC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="20"/>
        </device>

        <!-- *************************  Device 'NM1120TC1AE'  ***************************** -->
        <device Dname="NM1120TC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NM1120ZC1AE'  ***************************** -->
        <device Dname="NM1120ZC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x7600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_29_5.FLM"        start="0x00000000"  size="0x7600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NM1120DB0AE'  ***************************** -->
        <device Dname="NM1120DB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="12"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
        </device>

        <!-- *************************  Device 'NM1120FB0AE'  ***************************** -->
        <device Dname="NM1120FB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
        </device>

