saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NM1120EB0AE'  ***************************** -->
        <device Dname="NM1120EB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
        </device>

        <!-- *************************  Device 'NM1120XB0AE'  ***************************** -->
        <device Dname="NM1120XB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="20"/>
        </device>

        <!-- *************************  Device 'NM1120TB0AE'  ***************************** -->
        <device Dname="NM1120TB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NM1120ZB0AE'  ***************************** -->
        <device Dname="NM1120ZB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1120AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1120_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1120_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="LIN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="6"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NM1200'  ***************************** -->
      <subFamily DsubFamily="NM1200">
        <processor  Dcore="Cortex-M0"/>
        <compile    header="Device/NM1200/Include/NM1200_NM1100.h"/>
        <description>The NM1200 series 32-bit microcontroller embeded with Cortex-M0 core.</description>
        <!-- *************************  Device 'NM1200LBAE'  ***************************** -->
        <device Dname="NM1200LBAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="34"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1200ZBAE'  ***************************** -->
        <device Dname="NM1200ZBAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

