saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NM1200TBAE'  ***************************** -->
        <device Dname="NM1200TBAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NM1100XBAE'  ***************************** -->
        <device Dname="NM1100XBAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFN"  		n="20"/>
        </device>

        <!-- *************************  Device 'NM1100FBAE'  ***************************** -->
        <device Dname="NM1100FBAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
        </device>

        <!-- *************************  Device 'NM1100DBAE'  ***************************** -->
        <device Dname="NM1100DBAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="11"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="5"	m="10"/>
        </device>

        <!-- *************************  Device 'NM1200LAAE'  ***************************** -->
        <device Dname="NM1200LAAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_8.FLM"        start="0x00000000"  size="0x2000"                   default="1"/>
          <feature type="IOs"  		n="34"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1200TAAE'  ***************************** -->
        <device Dname="NM1200TAAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_8.FLM"        start="0x00000000"  size="0x2000"                   default="1"/>
          <feature type="IOs"  		n="29"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NM1100XAAE'  ***************************** -->
        <device Dname="NM1100XAAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_8.FLM"        start="0x00000000"  size="0x2000"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
          <feature type="QFN"  		n="20"/>
        </device>

        <!-- *************************  Device 'NM1100FAAE'  ***************************** -->
        <device Dname="NM1100FAAE">
          <debug      svd   ="SVD/Nuvoton/NM1200AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1200_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1200_AP_8.FLM"        start="0x00000000"  size="0x2000"                   default="1"/>
          <feature type="IOs"  		n="17"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
        </device>
      </subFamily>

