saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
      <!-- *************************  Subfamily 'NM1230'  ***************************** -->
      <subFamily DsubFamily="NM1230">
        <processor  Dcore="Cortex-M0"/>
        <compile    header="Device/NM1230/Include/NM1230Series.h"/>
        <description>The NM1230 series 32-bit microcontroller embeded with Cortex-M0 core.</description>
        <!-- *************************  Device 'NM1234D'  ***************************** -->
        <device Dname="NM1234D">
<!--          <debug      svd   ="SVD/Nuvoton/NM1230_v1.svd"/>	-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1230_LD_7_5.FLM"        start="0x00100000"  size="0x1e00"                   default="0"/>
          <algorithm  name  ="Flash/NM1230_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="44"/>
          <feature type="Timer"  		n="5"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="3"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1234Y'  ***************************** -->
        <device Dname="NM1234Y">
<!--          <debug      svd   ="SVD/Nuvoton/NM1230_v1.svd"/>	-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1230_LD_7_5.FLM"        start="0x00100000"  size="0x1e00"                   default="0"/>
          <algorithm  name  ="Flash/NM1230_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="44"/>
          <feature type="Timer"  		n="5"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="3"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFN"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1233D'  ***************************** -->
        <device Dname="NM1233D">
<!--          <debug      svd   ="SVD/Nuvoton/NM1230_v1.svd"/>	-->
          <memory     id="IROM1"    start="0x00000000"  size="0xc000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1230_LD_7_5.FLM"        start="0x00100000"  size="0x1e00"                   default="0"/>
          <algorithm  name  ="Flash/NM1230_AP_48.FLM"        start="0x00000000"  size="0xc000"                   default="1"/>
          <feature type="IOs"  		n="44"/>
          <feature type="Timer"  		n="5"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="3"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1233Y'  ***************************** -->
        <device Dname="NM1233Y">
<!--          <debug      svd   ="SVD/Nuvoton/NM1230_v1.svd"/>	-->
          <memory     id="IROM1"    start="0x00000000"  size="0xc000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1230_LD_7_5.FLM"        start="0x00100000"  size="0x1e00"                   default="0"/>
          <algorithm  name  ="Flash/NM1230_AP_48.FLM"        start="0x00000000"  size="0xc000"                   default="1"/>
          <feature type="IOs"  		n="44"/>
          <feature type="Timer"  		n="5"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="3"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFN"  		n="48"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NM1320'  ***************************** -->
      <subFamily DsubFamily="NM1320">
        <processor  Dcore="Cortex-M0"/>
        <compile    header="Device/NM1320/Include/NM1320.h"/>
        <description>The NM1320 series 32-bit microcontroller embeded with Cortex-M0 core.</description>
        <!-- *************************  Device 'NM1320LC2AE'  ***************************** -->
        <device Dname="NM1320LC2AE">
          <debug      svd   ="SVD/Nuvoton/NM1320AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x9000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1320_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1320_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NM1320_AP_36.FLM"        start="0x00000000"  size="0x9000"                   default="1"/>
          <feature type="IOs"  		n="42"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="3"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NM1330'  ***************************** -->
      <subFamily DsubFamily="NM1330">
        <processor  Dcore="Cortex-M0"/>
        <compile    header="Device/NM1330/Include/NM1330Series.h"/>
        <description>The NM1330 series 32-bit microcontroller embeded with Cortex-M0 core.</description>
        <!-- *************************  Device 'NM1330LC1AE'  ***************************** -->
        <device Dname="NM1330LC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1330AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1330_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1330_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NM1330_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

