saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NM1330LD2AE'  ***************************** -->
        <device Dname="NM1330LD2AE">
          <debug      svd   ="SVD/Nuvoton/NM1330AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1330_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1330_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/NM1330_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="AnalogOther"	n="4"/>
          <feature type="PWM"  		n="8"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NM1500'  ***************************** -->
      <subFamily DsubFamily="NM1500">
        <processor  Dcore="Cortex-M0"  Dclock="50000000"/>
        <compile    header="Device/NM1500/Include/NM1500.h"/>
		<description>The NuMicro NM1500 Series 32-bit microcontroller is embedded with the newest ARM Cortex-M0 core at a cost equivalent to traditional 
8-bit microcontroller for industrial control and applications which need high performance.</description>
        <!-- *************************  Device 'NM1530VE3AE'  ***************************** -->
        <device Dname="NM1530VE3AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="82"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="14"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NM1530VD3AE'  ***************************** -->
        <device Dname="NM1530VD3AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="82"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="14"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NM1520RD2AE'  ***************************** -->
        <device Dname="NM1520RD2AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="51"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="13"	m="16"/>
          <feature type="ADC"  		n="14"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NM1520RC2AE'  ***************************** -->
        <device Dname="NM1520RC2AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="51"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="13"	m="16"/>
          <feature type="ADC"  		n="14"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NM1530LE3AE'  ***************************** -->
        <device Dname="NM1530LE3AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="37"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="9"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1520LD2AE'  ***************************** -->
        <device Dname="NM1520LD2AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
          <feature type="IOs"  		n="37"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="9"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

