saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NM1520LC2AE'  ***************************** -->
        <device Dname="NM1520LC2AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="37"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="CAN"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="9"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1510LC1AE'  ***************************** -->
        <device Dname="NM1510LC1AE">
          <debug      svd   ="SVD/Nuvoton/NM1500_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1500_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_LD_8.FLM"        start="0x00100000"  size="0x2000"                   default="0"/>
          <algorithm  name  ="Flash/NM1500_AP_32.FLM"        start="0x00000000"  size="0x8000"                   default="1"/>
          <feature type="IOs"  		n="37"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="1"/>
          <feature type="PWM"  		n="9"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'NM1820'  ***************************** -->
      <subFamily DsubFamily="NM1820">
        <processor  Dcore="Cortex-M0"/>
        <compile    header="Device/NM1820/Include/NM1820Series.h"/>
        <description>The NM1820 series 32-bit microcontroller embeded with Cortex-M0 core.</description>
        <!-- *************************  Device 'NM1821FB0AE'  ***************************** -->
        <device Dname="NM1821FB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="10"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="4"	m="10"/>
        </device>

        <!-- *************************  Device 'NM1820EB0AE'  ***************************** -->
        <device Dname="NM1820EB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="7"	m="10"/>
        </device>

        <!-- *************************  Device 'NM1820ZB0AE'  ***************************** -->
        <device Dname="NM1820ZB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'NM1820LB0AE'  ***************************** -->
        <device Dname="NM1820LB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="33"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1824FB0AE'  ***************************** -->
        <device Dname="NM1824FB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="10"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="4"	m="10"/>
        </device>

