saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NM1823EB0AE'  ***************************** -->
        <device Dname="NM1823EB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="18"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="7"	m="10"/>
        </device>

        <!-- *************************  Device 'NM1823ZB0AE'  ***************************** -->
        <device Dname="NM1823ZB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFN"  		n="32"/>
        </device>

        <!-- *************************  Device 'NM1823LB0AE'  ***************************** -->
        <device Dname="NM1823LB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="33"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NM1827UB0AE'  ***************************** -->
        <device Dname="NM1827UB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="22"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="8"	m="10"/>
        </device>

        <!-- *************************  Device 'NM1827MB0AE'  ***************************** -->
        <device Dname="NM1827MB0AE">
          <debug      svd   ="SVD/Nuvoton/NM1820AE_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x4600"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NM1820_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_LD_2.FLM"        start="0x00100000"  size="0x800"                   default="0"/>
          <algorithm  name  ="Flash/NM1820_AP_17_5.FLM"        start="0x00000000"  size="0x4600"                   default="1"/>
          <feature type="IOs"  		n="30"/>
          <feature type="Timer"  		n="2"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="1"/>
          <feature type="I2C"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="12"	m="10"/>
          <feature type="QFP"  		n="44"/>
        </device>
      </subFamily>
    </family>

    <family Dfamily="NuMicro M23 Family" Dvendor="Nuvoton:18">
      <!-- *************************  Subfamily 'M251'  ***************************** -->
      <subFamily DsubFamily="M251">
        <processor  Dcore="Cortex-M23"  Dclock="48000000"/>
        <compile    header="Device/M251/Include/M251.h"/>
        <description>The NuMicro M251 series is a 32-bit microcontroller with embedded ARM Cortex-M23 core.</description>
        <!-- *************************  Device 'M251FB2AE'  ***************************** -->
        <device Dname="M251FB2AE">
          <memory     id="IROM1"    start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M251_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M251_AP_16.FLM"        start="0x00000000"  size="0x4000"                   default="1"/>
          <feature type="IOs"  		n="16"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="PWM"  		n="11"	m="16"/>
          <feature type="ADC"  		n="7"	m="12"/>
        </device>

