saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC442VG8AE'  ***************************** -->
        <device Dname="NUC442VG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="77"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="11"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC442VI8AE'  ***************************** -->
        <device Dname="NUC442VI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="77"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="11"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC442KG8AE'  ***************************** -->
        <device Dname="NUC442KG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="101"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'NUC442KI8AE'  ***************************** -->
        <device Dname="NUC442KI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="101"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'NUC442JG8AE'  ***************************** -->
        <device Dname="NUC442JG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="114"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="144"/>
        </device>

        <!-- *************************  Device 'NUC442JI8AE'  ***************************** -->
        <device Dname="NUC442JI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="114"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="144"/>
        </device>

        <!-- *************************  Device 'NUC472VG8AE'  ***************************** -->
        <device Dname="NUC472VG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="77"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="11"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC472VI8AE'  ***************************** -->
        <device Dname="NUC472VI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="77"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="11"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'NUC472KG8AE'  ***************************** -->
        <device Dname="NUC472KG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="101"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'NUC472KI8AE'  ***************************** -->
        <device Dname="NUC472KI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="101"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'NUC472JG8AE'  ***************************** -->
        <device Dname="NUC472JG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="114"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="144"/>
        </device>

