saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC472JI8AE'  ***************************** -->
        <device Dname="NUC472JI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="114"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="144"/>
        </device>

        <!-- *************************  Device 'NUC472HG8AE'  ***************************** -->
        <device Dname="NUC472HG8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="144"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="176"/>
        </device>

        <!-- *************************  Device 'NUC472HI8AE'  ***************************** -->
        <device Dname="NUC472HI8AE">
          <debug      svd   ="SVD/Nuvoton/NUC400_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x10000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC400_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_LD_16.FLM"        start="0x00100000"  size="0x4000"                   default="0"/>
          <algorithm  name  ="Flash/NUC400_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="144"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="12"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="5"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="6"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="3"/>
          <feature type="PWM"  		n="16"	m="16"/>
          <feature type="ADC"  		n=" 16"	m="12"/>
          <feature type="QFP"  		n="176"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'M451'  ***************************** -->
      <subFamily DsubFamily="M451">
        <processor  Dcore="Cortex-M4"  Dclock="72000000"  Dfpu="FPU"/>
        <compile    header="Device/M451/Include/M451Series.h"/>
        <description>The NuMicro M451 series 32-bit microcontrollers are embedded with ARM Cortex-M4F core for industrial control and applications 
which need high density memories and rich communication interfaces. 
The NuMicro M451 Network Line embeds Cortex-M4F core with DSP extensions and a Floating Point Unit running up to 72 MHz with 256K/128K bytes 
embedded flash and 32 Kbytes embedded SRAM. It is also equipped with plenty of peripheral devices, such as Timers, Watchdog Timers, RTC, PDMA, 
EBI, UART, Smart Card interface, SPI, I2S, I2C, CAN, PWM Timer, GPIO, 12-bit ADC, 12-bit DAC, touch key sensor, analog comparator, temperature sensor, 
Low voltage reset and Brown-out Detector.
		</description>
        <!-- *************************  Device 'M451VG6AE'  ***************************** -->
        <device Dname="M451VG6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="85"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

