saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'M451VC3AE'  ***************************** -->
        <device Dname="M451VC3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0xa000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_40.FLM"        start="0x00000000"  size="0xa000"                   default="1"/>
          <feature type="IOs"  		n="73"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'M451RD3AE'  ***************************** -->
        <device Dname="M451RD3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_72.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
          <feature type="IOs"  		n="55"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M451RC3AE'  ***************************** -->
        <device Dname="M451RC3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0xa000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_40.FLM"        start="0x00000000"  size="0xa000"                   default="1"/>
          <feature type="IOs"  		n="55"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M451SD3AE'  ***************************** -->
        <device Dname="M451SD3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_72.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
          <feature type="IOs"  		n="55"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M451SC3AE'  ***************************** -->
        <device Dname="M451SC3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0xa000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_40.FLM"        start="0x00000000"  size="0xa000"                   default="1"/>
          <feature type="IOs"  		n="55"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

