saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'M451LD3AE'  ***************************** -->
        <device Dname="M451LD3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_72.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M451LC3AE'  ***************************** -->
        <device Dname="M451LC3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0xa000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_40.FLM"        start="0x00000000"  size="0xa000"                   default="1"/>
          <feature type="IOs"  		n="40"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M451YD3AE'  ***************************** -->
        <device Dname="M451YD3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_72.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
          <feature type="IOs"  		n="27"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="36"/>
        </device>

        <!-- *************************  Device 'M451YC3AE'  ***************************** -->
        <device Dname="M451YC3AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0xa000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_40.FLM"        start="0x00000000"  size="0xa000"                   default="1"/>
          <feature type="IOs"  		n="27"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="6"	m="16"/>
          <feature type="ADC"  		n="9"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="36"/>
        </device>

        <!-- *************************  Device 'M452VG6AE'  ***************************** -->
        <device Dname="M452VG6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="82"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'M452VE6AE'  ***************************** -->
        <device Dname="M452VE6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="82"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'M452RG6AE'  ***************************** -->
        <device Dname="M452RG6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="48"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M452RE6AE'  ***************************** -->
        <device Dname="M452RE6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="48"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M452LG6AE'  ***************************** -->
        <device Dname="M452LG6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="34"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="LIN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

