saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'M4TKRG6AE'  ***************************** -->
        <device Dname="M4TKRG6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="48"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="CAN"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M4TKVE6AE'  ***************************** -->
        <device Dname="M4TKVE6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="80"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="CAN"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>

        <!-- *************************  Device 'M4TKVG6AE'  ***************************** -->
        <device Dname="M4TKVG6AE">
          <debug      svd   ="SVD/Nuvoton/M451_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="80"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="LIN"  		n="2"/>
          <feature type="CAN"  		n="1"/>
          <feature type="I2S"  		n="2"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="1"	m="12"/>
          <feature type="QFP"  		n="100"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'M4521'  ***************************** -->
      <subFamily DsubFamily="M4521">
        <processor  Dcore="Cortex-M4"  Dclock="72000000"  Dfpu="FPU"/>
        <compile    header="Device/M4521/Include/M4521.h"/>
        <description>The NuMicro M4521 series 32-bit microcontroller powered by Cortex-M4F with DSP and FPU runs up to 72 MHz.</description>
        <!-- *************************  Device 'M4521LE6AE'  ***************************** -->
        <device Dname="M4521LE6AE">
          <debug      svd   ="SVD/Nuvoton/M4521_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="4"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="PWM"  		n="10"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M4521SE6AE'  ***************************** -->
        <device Dname="M4521SE6AE">
          <debug      svd   ="SVD/Nuvoton/M4521_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="49"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M4521RE6AE'  ***************************** -->
        <device Dname="M4521RE6AE">
          <debug      svd   ="SVD/Nuvoton/M4521_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M451_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M451_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M451_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
          <feature type="IOs"  		n="49"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="5"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="12"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>
      </subFamily>

      <!-- *************************  Subfamily 'M480'  ***************************** -->
      <subFamily DsubFamily="M480">
        <processor  Dcore="Cortex-M4"  Dclock="192000000"  Dfpu="FPU"/>
        <compile    header="Device/M480/Include/M480.h"/>
        <description>The NuMicro M480 series 32-bit microcontroller powered by Cortex-M4F with DSP extension runs up to 192 MHz with 175µA/MHz power consumption.</description>
        <!-- *************************  Device 'M481ZGDAE'  ***************************** -->
        <device Dname="M481ZGDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="27"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="3"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

