saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'M482ZIDAE'  ***************************** -->
        <device Dname="M482ZIDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="26"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="10"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFN"  		n="33"/>
        </device>

        <!-- *************************  Device 'M482LGAAE'  ***************************** -->
        <device Dname="M482LGAAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x18000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="42"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M482LIDAE'  ***************************** -->
        <device Dname="M482LIDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="42"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="12"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'M482SGAAE'  ***************************** -->
        <device Dname="M482SGAAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x18000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="53"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M482SIDAE'  ***************************** -->
        <device Dname="M482SIDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="53"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'M482KGAAE'  ***************************** -->
        <device Dname="M482KGAAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x18000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_256.FLM"        start="0x00000000"  size="0x40000"                   default="1"/>
          <feature type="IOs"  		n="100"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'M482KIDAE'  ***************************** -->
        <device Dname="M482KIDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="100"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

