saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'M487KIDAE'  ***************************** -->
        <device Dname="M487KIDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="101"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="128"/>
        </device>

        <!-- *************************  Device 'M487JIDAE'  ***************************** -->
        <device Dname="M487JIDAE">
          <debug      svd   ="SVD/Nuvoton/M481_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/M481_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash/M481_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash/M481_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
          <feature type="IOs"  		n="115"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="6"/>
          <feature type="SPI"  		n="4"/>
          <feature type="I2C"  		n="3"/>
          <feature type="USBD"  		n="1"/>
          <feature type="CAN"  		n="2"/>
          <feature type="I2S"  		n="1"/>
          <feature type="AnalogOther"	n="2"/>
          <feature type="PWM"  		n="24"	m="16"/>
          <feature type="ADC"  		n="16"	m="12"/>
          <feature type="DAC"  		n="2"	m="12"/>
          <feature type="QFP"  		n="144"/>
        </device>
      </subFamily>
	  
      <!-- *************************  Subfamily 'NUC505'  ***************************** -->
      <subFamily DsubFamily="NUC505">
        <processor  Dcore="Cortex-M4"  Dclock="100000000"  Dfpu="FPU"/>
        <compile    header="Device/NUC505/Include/NUC505Series.h"/>
        <description>The NuMicro NUC505 series 32-bit microcontrollers are embedded with Cortex-M4F core for consumer and industrial applications which need high computing power and rich communication interfaces. 
The Cortex-M4F core within NuMicro NUC505 series can run up to 100 MHz and support DSP extensions and Floating Point Unit (FPU) function.</description>
        <!-- *************************  Device 'NUC505DLA'  ***************************** -->
        <device Dname="NUC505DLA">
          <debug      svd   ="SVD/Nuvoton/NUC505_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x20000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC505_SPIFLASH.FLM"        start="0x00000000"  size="0x200000"                   default="1"/>
          <feature type="IOs"  		n="20"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC505DL13Y'  ***************************** -->
        <device Dname="NUC505DL13Y">
          <debug      svd   ="SVD/Nuvoton/NUC505_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x200000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x20000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC505_SPIFLASH.FLM"        start="0x00000000"  size="0x200000"                   default="1"/>
          <feature type="IOs"  		n="25"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFP"  		n="48"/>
        </device>

        <!-- *************************  Device 'NUC505YLA'  ***************************** -->
        <device Dname="NUC505YLA">
          <debug      svd   ="SVD/Nuvoton/NUC505_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x20000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC505_SPIFLASH.FLM"        start="0x00000000"  size="0x200000"                   default="1"/>
          <feature type="IOs"  		n="20"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="2"/>
          <feature type="SPI"  		n="2"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFN"  		n="48"/>
        </device>

