saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
        <!-- *************************  Device 'NUC505DSA'  ***************************** -->
        <device Dname="NUC505DSA">
          <debug      svd   ="SVD/Nuvoton/NUC505_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x20000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC505_SPIFLASH.FLM"        start="0x00000000"  size="0x200000"                   default="1"/>
          <feature type="IOs"  		n="34"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="ADC"  		n="5"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC505DS13Y'  ***************************** -->
        <device Dname="NUC505DS13Y">
          <debug      svd   ="SVD/Nuvoton/NUC505_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x200000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x20000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC505_SPIFLASH.FLM"        start="0x00000000"  size="0x200000"                   default="1"/>
          <feature type="IOs"  		n="35"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFP"  		n="64"/>
        </device>

        <!-- *************************  Device 'NUC505YO13Y'  ***************************** -->
        <device Dname="NUC505YO13Y">
          <debug      svd   ="SVD/Nuvoton/NUC505_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x200000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x20000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash/NUC505_SPIFLASH.FLM"        start="0x00000000"  size="0x200000"                   default="1"/>
          <feature type="IOs"  		n="52"/>
          <feature type="Timer"  		n="4"	m="32"/>
          <feature type="UART"  		n="3"/>
          <feature type="SPI"  		n="3"/>
          <feature type="I2C"  		n="2"/>
          <feature type="USBD"  		n="1"/>
          <feature type="I2S"  		n="1"/>
          <feature type="PWM"  		n="4"	m="16"/>
          <feature type="ADC"  		n="8"	m="12"/>
          <feature type="QFN"  		n="88"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="M0NuMicro M031 Device">
      <description>Nuvoton M0NuMicro M031 Series devices</description>
      <accept  Dvendor="Nuvoton:18"  Dname="M031[FETLS][BCDE][0123]AE"/>
      <accept  Dvendor="Nuvoton:18"  Dname="M032[LS]E3AE"/>
    </condition>
    <condition id="M0NuMicro M051 Device">
      <description>Nuvoton M0NuMicro M051 Series devices</description>
      <accept  Dvendor="Nuvoton:18"  Dname="M052[LZ][ABD][NE]"/>
      <accept  Dvendor="Nuvoton:18"  Dname="M054[LZ][ABD][NE]"/>
      <accept  Dvendor="Nuvoton:18"  Dname="M058[LZ][ABD][NE]"/>
      <accept  Dvendor="Nuvoton:18"  Dname="M0516[LZ][ABD][NE]"/>
      <accept  Dvendor="Nuvoton:18"  Dname="Generic_M051_Series"/>
    </condition>
    <condition id="M0NuMicro M058S Device">
      <description>Nuvoton M0NuMicro M058S Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M058S[FZLS]AN"/>
    </condition>
    <condition id="M23NuMicro M251 Device">
      <description>Nuvoton M23NuMicro M251 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M25[12][FEZLSK][BCDG][26]AE"/>
    </condition>
    <condition id="M4NuMicro M451 Device">
      <description>Nuvoton M4NuMicro M451 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M45[123][VRLSY][EGDC][36]AE"/>
      <accept Dvendor="Nuvoton:18"  Dname="M451M[RLS][GEDC][36]AE"/>
      <accept Dvendor="Nuvoton:18"  Dname="M4LED[LR][GE]6AE"/>
      <accept Dvendor="Nuvoton:18"  Dname="M4TK[LRV][EG]6AE"/>
    </condition>
    <condition id="M4NuMicro M480 Device">
      <description>Nuvoton M4NuMicro M480 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M48[123457][KSLZJVO][IG][DA]AE"/>
	  <accept Dvendor="Nuvoton:18"  Dname="M484[KS][IG][DA]AE2U"/>
    </condition>
    <condition id="M0NuMicro M0518 Device">
      <description>Nuvoton M0NuMicro M0518 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M0518[LS][CD]2AE"/>
    </condition>
    <condition id="M0NuMicro M0519 Device">
      <description>Nuvoton M0NuMicro M0519 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M0519[LSV][DE]3AE"/>
    </condition>
    <condition id="M0NuMicro M0564 Device">
      <description>Nuvoton M0NuMicro M0564 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M0564[LRV][EG]4AE"/>
    </condition>
    <condition id="M23NuMicro M2351 Device">
      <description>Nuvoton M23NuMicro M2351 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M2351[KSZ]IAAE"/>
      <accept Dvendor="Nuvoton:18"  Dname="M2351KIAAEES"/>
    </condition>
    <condition id="M4NuMicro M4521 Device">
      <description>Nuvoton M4NuMicro M4521 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="M4521[LSR]E6AE"/>
    </condition>
    <condition id="M0NuMicro Mini51 Device">
      <description>Nuvoton M0NuMicro Mini51 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="Mini5[124][FTZL][AD][NE]"/>
      <accept Dvendor="Nuvoton:18"  Dname="Generic_Mini51_Series"/>
    </condition>
    <condition id="M0NuMicro Mini55 Device">
      <description>Nuvoton M0NuMicro Mini55 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="Mini5[124]X[ZL]AE"/>
	  <accept Dvendor="Nuvoton:18"  Dname="Mini5[124]XFHC"/>
	  <accept Dvendor="Nuvoton:18"  Dname="Mini55[ZLT]DE"/>
    </condition>
    <condition id="M0NuMicro Mini57 Device">
      <description>Nuvoton M0NuMicro Mini57 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="Mini57[FEXT]DE"/>
    </condition>
    <condition id="M0NuMicro Mini58 Device">
      <description>Nuvoton M0NuMicro Mini58 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="Mini58[FTZQL][DH][EC]"/>
    </condition>
