saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
    <condition id="M0NuMicro NANO100AN Device">
      <description>Nuvoton M0NuMicro NANO100A Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NANO1[02]0[ZLSV][CD][23]AN"/>
      <accept Dvendor="Nuvoton:18"  Dname="Generic_Nano100_Series"/>
    </condition>
    <condition id="M0NuMicro NANO100BN Device">
      <description>Nuvoton M0NuMicro NANO100B Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NANO1[0123]0[LSRNK][CDE][23]BN"/>
    </condition>
    <condition id="M0NuMicro NANO103 Device">
      <description>Nuvoton M0NuMicro NANO103 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NANO103[ZLS][CD][23]AE"/>
    </condition>
    <condition id="M0NuMicro NANO112 Device">
      <description>Nuvoton M0NuMicro NANO112 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NANO1[01]2[ZLSRV][BC][12]AN"/>
    </condition>
    <condition id="M0NuMicro NDA102 Device">
      <description>Nuvoton M0NuMicro NDA102 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NDA102[EF]C1"/>
    </condition>
    <condition id="M0NuMicro NM1120 Device">
      <description>Nuvoton M0NuMicro NM1120 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM1120[DEFXTZ][BC][01]AE"/>
    </condition>
    <condition id="M0NuMicro NM1100_1200 Device">
      <description>Nuvoton M0NuMicro NM1100_1200 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM1[12]00[LZTXFD][AB]AE"/>
    </condition>
    <condition id="M0NuMicro NM1230 Device">
      <description>Nuvoton M0NuMicro NM1230 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM123[34][DY]"/>
    </condition>
    <condition id="M0NuMicro NM1320 Device">
      <description>Nuvoton M0NuMicro NM1320 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM1320LC2AE"/>
    </condition>
    <condition id="M0NuMicro NM1330 Device">
      <description>Nuvoton M0NuMicro NM1330 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM1330L[CD][12]AE"/>
    </condition>
    <condition id="M0NuMicro NM1500 Device">
      <description>Nuvoton M0NuMicro NM1500 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM15[123]0[VRL][EDC][123]AE"/>
    </condition>
    <condition id="M0NuMicro NM1820 Device">
      <description>Nuvoton M0NuMicro NM1820 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NM182[01347][FEZLUM]B0AE"/>
    </condition>
    <condition id="M0NuMicro NUC029AE Device">
      <description>Nuvoton M0NuMicro NUC029AE Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC029FAE"/>
    </condition>
    <condition id="M0NuMicro NUC029AN Device">
      <description>Nuvoton M0NuMicro NUC029AN Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC029[TL]AN"/>
    </condition>
    <condition id="M0NuMicro NUC029DE Device">
      <description>Nuvoton M0NuMicro NUC029DE Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC029[LS]DE"/>
    </condition>
    <condition id="M0NuMicro NUC029EE Device">
      <description>Nuvoton M0NuMicro NUC029EE Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC029[LS]EE"/>
    </condition>
    <condition id="M0NuMicro NUC029GE Device">
      <description>Nuvoton M0NuMicro NUC029GE Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC029[LS]GE"/>
    </condition>
    <condition id="M0NuMicro NUC100 Device">
      <description>Nuvoton M0NuMicro NUC100 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC1[0234]0[LRV][CDE][123][ABCD][NE]"/>
      <accept Dvendor="Nuvoton:18"  Dname="Generic_NUC100_Series"/>
    </condition>
    <condition id="M0NuMicro NUC121 Device">
      <description>Nuvoton M0NuMicro NUC121 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC12[15][WYZLS]C2AE"/>
    </condition>
    <condition id="M0NuMicro NUC122 Device">
      <description>Nuvoton M0NuMicro NUC122 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC122[LSZ][CD][12]AN"/>
    </condition>
    <condition id="M0NuMicro NUC123 Device">
      <description>Nuvoton M0NuMicro NUC123 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC123[LSZ][CD][24][AB][NE][01]"/>
    </condition>
    <condition id="M0NuMicro NUC126 Device">
      <description>Nuvoton M0NuMicro NUC126 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC126[LRV][EG]4AE"/>
    </condition>
    <condition id="M0NuMicro NUC131 Device">
      <description>Nuvoton M0NuMicro NUC131 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC131[LS][CD]2AE"/>
    </condition>
    <condition id="M0NuMicro NUC200 Device">
      <description>Nuvoton M0NuMicro NUC200 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC2[02]0[RLSZV][CDE][123]A[NE]"/>
      <accept Dvendor="Nuvoton:18"  Dname="Generic_NUC200_Series"/>
    </condition>
    <condition id="M0NuMicro NUC230_240 Device">
      <description>Nuvoton M0NuMicro NUC230_240 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC2[34]0[RLSZV][CDE][123]AE"/>
    </condition>
    <condition id="M4NuMicro NUC472 Device">
      <description>Nuvoton M4NuMicro NUC472 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC4[47]2[HRVKJ][IG]8AE"/>
    </condition>
    <condition id="M4NuMicro NUC505 Device">
      <description>Nuvoton M4NuMicro NUC505 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC505[DY][SLO]13Y"/>
	  <accept Dvendor="Nuvoton:18"  Dname="NUC505[DY][SL]A"/>
    </condition>
    <condition id="M0NuMicro NUC1261 Device">
      <description>Nuvoton M0NuMicro NUC1261 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC1261[LS][EG]4AE"/>
    </condition>
    <condition id="M0NuMicro NUC2201 Device">
      <description>Nuvoton M0NuMicro NUC2201 Series devices</description>
      <accept Dvendor="Nuvoton:18"  Dname="NUC2201[LS]E3AE"/>
    </condition>
