saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
  </conditions>
  
  <components>
    <!-- *************************  Startup file  ***************************** -->
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro M031 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M031 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M031/StdDriver/inc/"/>
		<file category="include" name="Device/M031/Include/"/>
        <file category="header"  name="Device/M031/Include/M031Series.h"/>
		<file category="header"  name="Device/M031/Include/NuMicro.h"/>
        <file category="header"  name="Device/M031/Include/system_M031Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M031/Source/ARM/startup_M031Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M031/Source/system_M031Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/M031/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro M051 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M051 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M051/StdDriver/inc/"/>
		<file category="include" name="Device/M051/Include/"/>
        <file category="header"  name="Device/M051/Include/M051Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M051/Source/ARM/startup_M051Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M051/Source/system_M051Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/M051/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro M058S Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M058S Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M058S/StdDriver/inc/"/>
		<file category="include" name="Device/M058S/Include/"/>
        <file category="header"  name="Device/M058S/Include/M058S.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M058S/Source/ARM/startup_M058S.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M058S/Source/system_M058S.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
		<file category="sourceC" name="Device/M058S/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M23NuMicro M251 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M251 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M251/StdDriver/inc/"/>
		<file category="include" name="Device/M251/Include/"/>
        <file category="header"  name="Device/M251/Include/M251.h"/>
		<file category="header"  name="Device/M251/Include/NuMicro.h"/>
        <file category="header"  name="Device/M251/Include/system_M251.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M251/Source/ARM/startup_M251.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M251/Source/system_M251.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/M251/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M4NuMicro M451 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M451 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M451/StdDriver/inc/"/>
		<file category="include" name="Device/M451/Include/"/>
        <file category="header"  name="Device/M451/Include/M451Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M451/Source/ARM/startup_M451Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M451/Source/system_M451Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/M451/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M4NuMicro M480 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M480 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M480/StdDriver/inc/"/>
		<file category="include" name="Device/M480/Include/"/>
        <file category="header"  name="Device/M480/Include/M480.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M480/Source/ARM/startup_M480.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M480/Source/system_M480.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/M480/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
