saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro M0518 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M0518 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M0518/StdDriver/inc/"/>
		<file category="include" name="Device/M0518/Include/"/>
        <file category="header"  name="Device/M0518/Include/M0518.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M0518/Source/ARM/startup_M0518.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M0518/Source/system_M0518.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
		<file category="sourceC" name="Device/M0518/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro M0519 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M0519 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M0519/StdDriver/inc/"/>
		<file category="include" name="Device/M0519/Include/"/>
        <file category="header"  name="Device/M0519/Include/M0519.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M0519/Source/ARM/startup_M0519.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M0519/Source/system_M0519.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
		<file category="sourceC" name="Device/M0519/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro M0564 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M0564 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M0564/StdDriver/inc/"/>
		<file category="include" name="Device/M0564/Include/"/>
        <file category="header"  name="Device/M0564/Include/M0564.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M0564/Source/ARM/startup_M0564.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M0564/Source/system_M0564.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
		<file category="sourceC" name="Device/M0564/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M23NuMicro M2351 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M2351 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M2351/StdDriver/inc/"/>
		<file category="include" name="Device/M2351/Include/"/>
        <file category="header"  name="Device/M2351/Include/M2351.h"/>
		<file category="header"  name="Device/M2351/Include/NuMicro.h"/>
        <file category="header"  name="Device/M2351/Include/system_M2351.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M2351/Source/ARM/startup_M2351.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M2351/Source/system_M2351.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/M2351/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M4NuMicro M4521 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton M4521 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/M4521/StdDriver/inc/"/>
		<file category="include" name="Device/M4521/Include/"/>
        <file category="header"  name="Device/M4521/Include/M4521.h"/>
        <file category="header"  name="Device/M4521/Include/system_M4521.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/M4521/Source/ARM/startup_M4521.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/M4521/Source/system_M4521.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/M4521/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro Mini51 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Mini51 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/Mini51/StdDriver/inc/"/>
		<file category="include" name="Device/Mini51/Include/"/>
        <file category="header"  name="Device/Mini51/Include/Mini51Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/Mini51/Source/ARM/startup_Mini51Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/Mini51/Source/system_Mini51Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/Mini51/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro Mini55 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Mini55 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/Mini55/StdDriver/inc/"/>
		<file category="include" name="Device/Mini55/Include/"/>
        <file category="header"  name="Device/Mini55/Include/Mini55Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/Mini55/Source/ARM/startup_Mini55Series.s" attr="config" version="3.01.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/Mini55/Source/system_Mini55Series.c" attr="config" version="3.01.001"/>
        <!-- retarget files -->
        <file category="sourceC" name="Device/Mini55/StdDriver/src/retarget.c" attr="config" version="3.01.001"/>
      </files>
    </component>
