saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro Mini57 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Mini57 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/Mini57/StdDriver/inc/"/>
		<file category="include" name="Device/Mini57/Include/"/>
        <file category="header"  name="Device/Mini57/Include/Mini57Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/Mini57/Source/ARM/startup_Mini57Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/Mini57/Source/system_Mini57Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/Mini57/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro Mini58 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Mini58 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/Mini58/StdDriver/inc/"/>
		<file category="include" name="Device/Mini58/Include/"/>
        <file category="header"  name="Device/Mini58/Include/Mini58Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/Mini58/Source/ARM/startup_Mini58Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/Mini58/Source/system_Mini58Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/Mini58/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NANO100AN Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Nano100AN Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NANO100AN/StdDriver/inc/"/>
		<file category="include" name="Device/NANO100AN/Include/"/>
        <file category="header"  name="Device/NANO100AN/Include/Nano100Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NANO100AN/Source/ARM/startup_Nano100Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NANO100AN/Source/system_Nano100Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->
        <file category="sourceC" name="Device/NANO100AN/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NANO100BN Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Nano100BN Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NANO100BN/StdDriver/inc/"/>
		<file category="include" name="Device/NANO100BN/Include/"/>
        <file category="header"  name="Device/NANO100BN/Include/Nano100Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NANO100BN/Source/ARM/startup_Nano100Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NANO100BN/Source/system_Nano100Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->
        <file category="sourceC" name="Device/NANO100BN/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NANO103 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Nano103 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NANO103/StdDriver/inc/"/>
		<file category="include" name="Device/NANO103/Include/"/>
        <file category="header"  name="Device/NANO103/Include/Nano103.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NANO103/Source/ARM/startup_Nano103.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NANO103/Source/system_Nano103.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NANO103/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NANO112 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton Nano112 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NANO112/StdDriver/inc/"/>
		<file category="include" name="Device/NANO112/Include/"/>
        <file category="header"  name="Device/NANO112/Include/Nano1x2Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NANO112/Source/ARM/startup_Nano1X2Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NANO112/Source/system_Nano1X2Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NANO112/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NDA102 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NDA102 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NDA102/StdDriver/inc/"/>
		<file category="include" name="Device/NDA102/Include/"/>
        <file category="header"  name="Device/NDA102/Include/NDA102Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NDA102/Source/ARM/startup_NDA102Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NDA102/Source/system_NDA102Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/NDA102/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1120 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1120 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1120/Include/"/>
        <file category="header"  name="Device/NM1120/Include/NM1120Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1120/Source/ARM/startup_NM1120Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1120/Source/system_NM1120Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/NM1120/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1100_1200 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1100_1200 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1200/Include/"/>
        <file category="header"  name="Device/NM1200/Include/NM1200_NM1100.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1200/Source/ARM/startup_NM1200_NM1100.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1200/Source/system_NM1200_NM1100.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NM1200/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1230 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1230 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1230/Include/"/>
        <file category="header"  name="Device/NM1230/Include/NM1230Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1230/Source/ARM/startup_NM1230Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1230/Source/system_NM1230Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/NM1230/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1320 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1320 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1320/Include/"/>
        <file category="header"  name="Device/NM1320/Include/NM1320.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1320/Source/ARM/startup_NM1320.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1320/Source/system_NM1320.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/NM1320/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1330 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1330 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1330/Include/"/>
        <file category="header"  name="Device/NM1330/Include/NM1330Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1330/Source/ARM/startup_NM1330Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1330/Source/system_NM1330Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/NM1330/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
