saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1500 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1500 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1500/Include/"/>
        <file category="header"  name="Device/NM1500/Include/NM1500.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1500/Source/ARM/startup_NM1500.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1500/Source/system_NM1500.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
		<file category="sourceC" name="Device/NM1500/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NM1820 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NM1820 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NM1820/Include/"/>
        <file category="header"  name="Device/NM1820/Include/NM1820Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NM1820/Source/ARM/startup_NM1820Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NM1820/Source/system_NM1820Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
        <file category="sourceC" name="Device/NM1820/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC029AE Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC029AE Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC029AE/StdDriver/inc/"/>
		<file category="include" name="Device/NUC029AE/Include/"/>
        <file category="header"  name="Device/NUC029AE/Include/NUC029FAE.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC029AE/Source/ARM/startup_NUC029FAE.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC029AE/Source/system_NUC029FAE.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC029AE/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC029AN Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC029AN Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC029AN/StdDriver/inc/"/>
		<file category="include" name="Device/NUC029AN/Include/"/>
        <file category="header"  name="Device/NUC029AN/Include/NUC029xAN.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC029AN/Source/ARM/startup_NUC029xAN.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC029AN/Source/system_NUC029xAN.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC029AN/StdDriver/src/retarget.c" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC029DE Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC029DE Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC029DE/StdDriver/inc/"/>
		<file category="include" name="Device/NUC029DE/Include/"/>
        <file category="header"  name="Device/NUC029DE/Include/NUC029xDE.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC029DE/Source/ARM/startup_NUC029xDE.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC029DE/Source/system_NUC029xDE.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->		
		<file category="sourceC" name="Device/NUC029DE/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC029EE Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC029EE Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC029EE/StdDriver/inc/"/>
		<file category="include" name="Device/NUC029EE/Include/"/>
        <file category="header"  name="Device/NUC029EE/Include/NUC029xEE.h"/>
        <file category="header"  name="Device/NUC029EE/Include/NuMicro.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC029EE/Source/ARM/startup_NUC029xEE.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC029EE/Source/system_NUC029xEE.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->
        <file category="sourceC" name="Device/NUC029EE/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC029GE Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC029GE Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC029GE/StdDriver/inc/"/>
		<file category="include" name="Device/NUC029GE/Include/"/>
        <file category="header"  name="Device/NUC029GE/Include/NUC029xGE.h"/>
        <file category="header"  name="Device/NUC029GE/Include/NuMicro.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC029GE/Source/ARM/startup_NUC029xGE.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC029GE/Source/system_NUC029xGE.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->
        <file category="sourceC" name="Device/NUC029GE/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC100 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC100 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC100/StdDriver/inc/"/>
		<file category="include" name="Device/NUC100/Include/"/>
        <file category="header"  name="Device/NUC100/Include/NUC100Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC100/Source/ARM/startup_NUC100Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC100/Source/system_NUC100Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC100/StdDriver/src/retarget.c" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC121 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC121 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC121/StdDriver/inc/"/>
		<file category="include" name="Device/NUC121/Include/"/>
        <file category="header"  name="Device/NUC121/Include/NUC121.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC121/Source/ARM/startup_NUC121.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC121/Source/system_NUC121.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC121/StdDriver/src/retarget.c" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC122 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC122 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC122/StdDriver/inc/"/>
		<file category="include" name="Device/NUC122/Include/"/>
        <file category="header"  name="Device/NUC122/Include/NUC122.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC122/Source/ARM/startup_NUC122.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC122/Source/system_NUC122.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC122/StdDriver/src/retarget.c" version="0.00.001"/>
      </files>
    </component>
