saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuMicro_DFP.1.3.2.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC123 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC123 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC123/StdDriver/inc/"/>
		<file category="include" name="Device/NUC123/Include/"/>
        <file category="header"  name="Device/NUC123/Include/NUC123.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC123/Source/ARM/startup_NUC123.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC123/Source/system_NUC123.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC123/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC126 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC126 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC126/StdDriver/inc/"/>
		<file category="include" name="Device/NUC126/Include/"/>
        <file category="header"  name="Device/NUC126/Include/NUC126.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC126/Source/ARM/startup_NUC126.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC126/Source/system_NUC126.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC126/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC131 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC131 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC131/StdDriver/inc/"/>
		<file category="include" name="Device/NUC131/Include/"/>
        <file category="header"  name="Device/NUC131/Include/NUC131.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC131/Source/ARM/startup_NUC131.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC131/Source/system_NUC131.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC131/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC200 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC200 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC200/StdDriver/inc/"/>
		<file category="include" name="Device/NUC200/Include/"/>
        <file category="header"  name="Device/NUC200/Include/NUC200Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC200/Source/ARM/startup_NUC200Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC200/Source/system_NUC200Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC200/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC230_240 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC230_240 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC230_240/StdDriver/inc/"/>
        <file category="include" name="Device/NUC230_240/Include/"/>
        <file category="header"  name="Device/NUC230_240/Include/NUC230_240.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC230_240/Source/ARM/startup_NUC230_240.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC230_240/Source/system_NUC230_240.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC230_240/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M4NuMicro NUC472 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC472 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC472/StdDriver/inc/"/>
		<file category="include" name="Device/NUC472/Include/"/>
        <file category="header"  name="Device/NUC472/Include/NUC472_442.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC472/Source/ARM/startup_NUC472_442.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC472/Source/system_NUC472_442.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC472/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M4NuMicro NUC505 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC505 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC505/StdDriver/inc/"/>
        <file category="include" name="Device/NUC505/Include/"/>
        <file category="header"  name="Device/NUC505/Include/NUC505Series.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC505/Source/ARM/startup_NUC505Series.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC505/Source/system_NUC505Series.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC505/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC1261 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC1261 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC1261/StdDriver/inc/"/>
		<file category="include" name="Device/NUC1261/Include/"/>
        <file category="header"  name="Device/NUC1261/Include/NUC1261.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC1261/Source/ARM/startup_NUC1261.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC1261/Source/system_NUC1261.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->	
        <file category="sourceC" name="Device/NUC1261/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.00.001" condition="M0NuMicro NUC2201 Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Nuvoton NUC2201 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>
      <files>
        <!-- header path -->
		<file category="include" name="Device/NUC2201/StdDriver/inc/"/>
		<file category="include" name="Device/NUC2201/Include/"/>
        <file category="header"  name="Device/NUC2201/Include/NUC2201.h"/>
        <file category="header"  name="Device/NUC2201/Include/NuMicro.h"/>
        <!-- startup/system files -->
        <file category="sourceAsm"  name="Device/NUC2201/Source/ARM/startup_NUC2201.s" attr="config" version="0.00.001" condition="Compiler ARM"/>
        <file category="source"  name="Device/NUC2201/Source/system_NUC2201.c" attr="config" version="0.00.001"/>
        <!-- retarget files -->
        <file category="sourceC" name="Device/NUC2201/StdDriver/src/retarget.c" attr="config" version="0.00.001"/>
      </files>
    </component>
  </components>
</package>
